TSD_TK/src/InformationRegisters/ВремяРаботыСДокументом/ВремяРаботыСДокументом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяРаботыСДокументом</name>
  <resources>
    <name>НачалоРаботыСдокументом</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОткрытСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтсканированоТовар</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВводВручнуюТовар</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументUUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипыДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TSD_TK/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>БезакцептныйПрием</name>
      <description>Безакцептне приймання</description>
    </items>
    <items>
      <name>БезакцептныйПриемPKG</name>
      <description>Безакцептный Прием PKG</description>
    </items>
    <items>
      <name>ВыдачаДС</name>
      <description>Видача ДС</description>
    </items>
    <items>
      <name>ЗаданиеИН</name>
      <description>Завдання інв-ція</description>
    </items>
    <items>
      <name>Задание</name>
      <description>Задание</description>
    </items>
    <items>
      <name>ЗаданиеВФ</name>
      <description>Задание Верификация</description>
    </items>
    <items>
      <name>Zak</name>
      <description>Замовлення</description>
    </items>
    <items>
      <name>Заявка</name>
      <description>Заявка</description>
    </items>
    <items>
      <name>Инвентаризация</name>
      <description>Инвентаризация</description>
    </items>
    <items>
      <name>ИнвентаризацияТБД</name>
      <description>Инвентаризация ТБД</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Контролер</name>
      <description>Контролер</description>
    </items>
    <items>
      <name>ЛокальнаяИнвентаризация</name>
      <description>Локальная инвентаризация</description>
    </items>
    <items>
      <name>МаршрутныйЛист</name>
      <description>Маршрутный лист</description>
    </items>
    <items>
      <name>ЗаданиеТБД</name>
      <description>Не продається</description>
    </items>
    <items>
      <name>ПроверкаСтандартов</name>
      <description>Перевірка стандартів</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ВозвратПеремещение</name>
      <description>Переміщення (логістика)</description>
    </items>
    <items>
      <name>Переоценки</name>
      <description>Переоценки</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортиця</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печать</description>
    </items>
    <items>
      <name>ВозвратТоваров</name>
      <description>Повернення постачальнику</description>
    </items>
    <items>
      <name>Посетители</name>
      <description>Посетители</description>
    </items>
    <items>
      <name>ПриемПоЗаказу</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемPKG</name>
      <description>Прием PKG</description>
    </items>
    <items>
      <name>ПриемПоПриходу</name>
      <description>Прием по приходу</description>
    </items>
    <items>
      <name>ПриходУход</name>
      <description>Приход уход</description>
    </items>
    <items>
      <name>Рекламация</name>
      <description>Рекламация</description>
    </items>
    <items>
      <name>Списание2</name>
      <description>Списание</description>
    </items>
    <items>
      <name>ЗаданиеТНП</name>
      <description>Термін придатності</description>
    </items>
    <items>
      <name>Уведомление</name>
      <description>Уведомление</description>
    </items>
    <items>
      <name>Уценка</name>
      <description>Уценка</description>
    </items>
    <items>
      <name>Фото</name>
      <description>Фото</description>
    </items>
    <items>
      <name>ФотоСчетчика</name>
      <description>Фото счетчика</description>
    </items>
  </predefined>
</mdclass:Catalog>

TSD_TK/src/InformationRegisters/ВремяРаботыСДокументом/ManagerModule.bsl
Функция ДокументЗаписываетДанныеВРегистр(ТипДокумента) 

	Если  ТипДокумента = Справочники.ТипыДокументов.ПриемПоПриходу 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПеремещениеТоваров
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда   
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьЗапись(ТекСтрока)Экспорт
	
	Если  ДокументЗаписываетДанныеВРегистр(ТекСтрока.ТипДокумента) Тогда
		
		Набор = РегистрыСведений.ВремяРаботыСДокументом.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ТекСтрока.ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТекСтрока.ТипДокумента);
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,ТекСтрока);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьДанныеВРаботе(ДокументUUID,ТипДокумента)Экспорт
	
	Если ДокументЗаписываетДанныеВРегистр(ТипДокумента) Тогда
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТипДокумента);
		
		Набор.Записать();
		
	КонецЕсли;

КонецПроцедуры


Функция ПолучитьСтруктуруВремяРаботыСдокументом(ДокументUUID,ТипДокумента)Экспорт 
	тСтруктура = Новый Структура;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВремяРаботыСДокументом.НачалоРаботыСдокументом КАК НачалоРаботыСдокументом,
	|	ВремяРаботыСДокументом.ДокументОткрытСекунд КАК ДокументОткрытСекунд,
	|	ВремяРаботыСДокументом.ОтсканированоТовар КАК ОтсканированоТовар,
	|	ВремяРаботыСДокументом.ВводВручнуюТовар КАК ВводВручнуюТовар
	|ИЗ
	|	РегистрСведений.ВремяРаботыСДокументом КАК ВремяРаботыСДокументом
	|ГДЕ
	|	ВремяРаботыСДокументом.ДокументUUID = &ДокументUUID
	|	И ВремяРаботыСДокументом.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ДокументUUID", ДокументUUID);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		тСтруктура.Вставить("НачалоРаботыСдокументом",Формат(ВыборкаДетальныеЗаписи.НачалоРаботыСдокументом,"ДФ=yyyyMMddЧЧммсс"));
		тСтруктура.Вставить("ДокументОткрытСекунд",ВыборкаДетальныеЗаписи.ДокументОткрытСекунд);
		тСтруктура.Вставить("ОтсканированоТовар",ВыборкаДетальныеЗаписи.ОтсканированоТовар);
		тСтруктура.Вставить("ВводВручнуюТовар",ВыборкаДетальныеЗаписи.ВводВручнуюТовар);
		тСтруктура.Вставить("КонецРаботыСДокументом",Формат(ТекущаяДата(),"ДФ=yyyyMMddЧЧммсс"));

	КонецЕсли;
	
	Возврат тСтруктура;
	
КонецФункции
